# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

x = 3
y = str(bin(x))
print(y[2:])

#######################Вариант2#############
# n = x
# m = n
# p = 1
# d1 = 0
# while m > 0:
#     d1 += n%2*p
#     p = p*10
#     n = n//2
# print (d1)    
