welcome = 'Привет! Я - бот-калькулятор для работы с рациональными и комплексными числами.\n\
Доступные действия можно увидеть по команде /help\n\
Примеры ввода выражений можно увидеть по команде /examples'

help = 'В калькуляторе доступны следующие действия для комплексных и рациональных чисел:\n\
1. "+" сложение\n\
2. "-" вычитание\n\
3. "*" умножение\n\
4. "/" деление\n\
5. "%" взятие остатка от деления\n\
6. "//" целочисленное деление\n\
7. "**" возведение в степень'

examples = 'Компелксные числа вводить без пробелов\n\
Пример: -23+2i, 9-3i\n\
Рациональные числа можно задавать в виде простых и десятичных дробей (пробелы недопустимы)\n\
Пример: 4/26, 62/9, 3.17\n\
Математические выражения вводить отделяя математический оператор пробелами\n\
Пример: -23+2i + 9-3i, 3/25 * 61/8'

zero_div_error = 'На ноль делить нельзя!'

error = 'Введено неверное выражение'